In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                   "degisken1": [10, 23, 33, 22, 11, 99],
                   "degisken2": [100, 253, 333, 262, 111, 969]}, columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [2]:
df["degisken1"] * 5

0     50
1    115
2    165
3    110
4     55
5    495
Name: degisken1, dtype: int64

In [5]:
df.groupby("gruplar").transform(lambda x, : x - x.mean())

   degisken1  degisken2
0       -6.0      -81.0
1        6.0       71.0
2      -33.0     -318.0
3        6.0       81.0
4       -6.0      -71.0
5       33.0      318.0